spec/support/vcr_cassettes/activemerchant_billing_payrixgateway/_disbursements/when_the_entity_id_is_for_a_valid_merchant_with_at_least_1_disbursement/contains_pagination_details.yml

---
http_interactions:
- request:
    method: get
    uri: https://test-api.payrix.com/disbursements?page%5Blimit%5D=1
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/json
      Apikey:
      - respec-test-token-will-not-work-in-production
      Search:
      - entity[equals]=t1_ent_62bc7a5235ddbe87f6fa04f
      Connection:
      - close
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 06 Sep 2023 19:07:48 GMT
      Content-Type:
      - application/json; charset=UTF-8
      Transfer-Encoding:
      - chunked
      Connection:
      - close
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1800'
      Access-Control-Allow-Methods:
      - GET,PUT,POST,DELETE,OPTIONS
      Access-Control-Allow-Headers:
      - ACCEPT,APIKEY,CONTENT-TYPE,PASSWORD,REQUEST-TOKEN,REQUEST_TOKEN,RESETKEY,SEARCH,SESSIONKEY,TOKEN,TOTALS,USERNAME,X-FORWARDED-FOR
      Cf-Cache-Status:
      - DYNAMIC
      Server:
      - cloudflare
      Cf-Ray:
      - 8028ff3beac0efda-PDX
    body:
      encoding: ASCII-8BIT
      string: '{"response":{"data":[{"id":"t1_dbm_630550ab2747cc033d0ecc8","created":"2022-08-23
        18:11:55.162","modified":"2022-08-23 18:12:06.5056","creator":"000000000000001","modifier":"000000000000001","entity":"t1_ent_62bc7a5235ddbe87f6fa04f","account":"09921635abef96def8b9cde4a4aba8a7","payout":"t1_pay_62c5d3f3e9566a738bbb776","description":"Disbursement
        for payout t1_pay_62c5d3f3e9566a738bbb776","amount":902,"status":2,"processed":null,"currency":"USD","payment":"t1_pmt_62bc7a522b9b49d65c60707","expiration":null,"sameDay":0,"returnedAmount":null,"statement":null,"settlement":null,"lastNegativeEntry":null,"lastNegativePendingEntry":null,"lastPositiveReserveEntry":null,"disbursementEntriesStatus":"pending","lastPositiveEntry":null,"lastPositivePendingEntry":null,"lastNegativeReserveEntry":null,"fundingStatus":"pending","secondaryDescriptor":""}],"details":{"requestId":1,"totals":[],"page":{"current":1,"last":2,"hasMore":true}},"errors":[]}}'
  recorded_at: Wed, 06 Sep 2023 19:07:48 GMT
recorded_with: VCR 6.1.0
