spec/support/vcr_cassettes/activemerchant_billing_payrixgateway/_token_purchase/when_a_transaction_can_not_be_made/returns_an_unsuccessful_response.yml

---
http_interactions:
- request:
    method: post
    uri: https://test-api.payrix.com/txns
    body:
      encoding: UTF-8
      string: '{"token":"NOT-A-VALID-TOKEN","currency":"USD","total":400,"origin":8,"type":1,"order":"1234567","description":"Payment
        for Invoice #10","tax":1}'
    headers:
      Content-Type:
      - application/json
      Apikey:
      - respec-test-token-will-not-work-in-production
      Connection:
      - close
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 11 May 2022 20:33:58 GMT
      Content-Type:
      - application/json; charset=UTF-8
      Transfer-Encoding:
      - chunked
      Connection:
      - close
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1800'
      Access-Control-Allow-Methods:
      - GET,PUT,POST,DELETE,OPTIONS
      Access-Control-Allow-Headers:
      - ACCEPT,APIKEY,CONTENT-TYPE,PASSWORD,REQUEST-TOKEN,REQUEST_TOKEN,RESETKEY,SEARCH,SESSIONKEY,TOKEN,TOTALS,USERNAME
      Cf-Cache-Status:
      - DYNAMIC
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Server:
      - cloudflare
      Cf-Ray:
      - 709db151ce348eae-DEN
    body:
      encoding: ASCII-8BIT
      string: '{"response":{"data":[],"details":{"requestId":1},"errors":[{"field":"token","code":15,"severity":2,"msg":"The
        referenced resource does not exist","errorCode":"no_such_record"},{"field":"merchant","code":15,"severity":2,"msg":"The
        referenced resource does not exist","errorCode":"no_such_record"}]}}'
  recorded_at: Wed, 11 May 2022 20:33:58 GMT
recorded_with: VCR 6.0.0
